Revit 2026 API

# IndexStreamTriangle Class

---

A stream that can be used to write IndexTriangle primitives into an IndexBuffer

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamTriangle

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStreamTriangle : IndexStream
```
```vb
Public Class IndexStreamTriangle
	Inherits IndexStream
```
```cpp
public ref class IndexStreamTriangle : public IndexStream
```
```fsharp
type IndexStreamTriangle =
    class
        inherit IndexStream
    end
```

The IndexStreamTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexStream) |

|  | Name | Description |
| --- | --- | --- |
|  | AddTriangle | Inserts a IndexTriangle into the stream and associated buffer. |
|  | AddTriangles |  |
|  | Dispose | (Inherited from IndexStream) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace